---
type: LayerModifier
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# LayerModifier

`Autodesk.Revit.DB.LayerModifier` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LayerModifier | — | `` |
| Constructor | LayerModifier | 2014 | `public LayerModifier ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ModifierType | 2014 | `public ModifierType ModifierType { get ; set ; }` |
| Property | Separator | 2014 | `public string Separator { get ; set ; }` |